# 2020.11.09
# Python은 인간다운 언어이다
if 4 in [1,2,3,4] : 
  print("4가 있습니다.")
# [] 안에 4가 있으면, print에 기입된 내용이 출력된다.
elif [5,6,7,8] : 
  print("여기에 해당됩니다.")
# elif[] = else if 에 해당하는 숫자면 여기에 해당된다고 출력
#else : 
 # print("앞의 두 조건식에 충족되지 않습니다.")
# 해당되는 숫자가 없다면 숫자는 없다라고 출력함.

# 파이썬은 문법이 쉬워 빠르게 배울 수 있다.
# 무료이고 강력하다
# 상대적으로 느린 파이썬과 빠른 c언어 조합이 가능
# 파이썬 라이브러리 중에 c언어로 만들어진것도 많다. ex)NumPy : c 라이브러리를 python에서 쓸 수 있도록 래핑
# 컴파일언어 : 빠름 (컴파일러를 통해 컴퓨터가 읽을수 있는 기계어로 변경)
# 인터프리터 언어 : 상대적으로 느림 (데이터가 한줄씩 읽힘)
# 컴퓨터는 0 과 1로 표시, 동작가능

# 파이썬은 간결하다. 규칙적이다.
# 개발속도가 빠르다.
# - 시스템유틸리티 제작
# - gui 프로그래밍(graphical user interface : 사용자가 편리하게 사용할 수 있도록 기능을 그래픽으로 나타낸 것)
# - c/c++와의 결합 용이 : 속도의 중요성이 낮은 부분은 파이썬으로 작업, 높은 부분은 c/c++로 작업
# 웹프로그래밍도 가능 with django / flask
# 수치 연산 프로그래밍 sql/mysql
# 데이터베이스 프로그래밍 dba / 주식분석 / tensorflow / IoT 사물인터넷
#----------------------------
# 단점 
# 시스템과 밀접한 프로그래밍 영역, 모바일 프로그래밍
# 앱 만들기 어려움: Kotlin /java , ios : swift, 운영체제 만들수 없다(linux, window os)
